export interface BaguaAttribute {
    id: string; // 乾、兑、离...
    name: string;
    description: string;
}

export const BAGUA_ATTRIBUTES: BaguaAttribute[] = [
    {
        id: 'qian',
        name: '乾卦',
        description: `一 金
乾为天 天风姤 天山遁 天地否
风地观 山地剥 火地晋 火天大有
天时：天、冰、雹、霰。
地理：西北方、京都、大郡、形胜之地、高亢之所。
人物：君、父、大人、老人、长者、官宦、名人、公门人。
静物：金玉、宝珠、圆物、水果、刚物、冠、镜。
身体：首、骨、肺。
动物：马、天鹅、狮、象。
人事：刚健武勇、果决、多动少静、高上下屈。
时序：秋、九十月之交、戌亥年月日时、一四九年月日时。
屋舍：公廨、楼台、高堂、大厦、驿舍、西北向之居。
家宅：秋占宅兴隆、夏占有祸、冬占冷落、春占吉利。
婚姻：贵官之眷、有声名之家、秋占宜成、冬夏占不利。
饮食：马肉、珍味、多骨、肝肺、干肉、水果、诸物之首、圆物、辛辣之物。
生产：易生、秋占生贵子，夏占有损，坐宜向西北。
求名：有名、宜随朝内任、刑官、武职、掌权、天使、驿官、宜西北方之任。
谋旺：有成、利公门、宜动中有财、夏占不成、冬占多谋少遂。
交易：宜金、玉珍宝珠贵货、易成、夏占不利。
求利：有财、金、玉之利、公门中得财、秋占大利、夏占损财、冬占无财。
出行：利于出行、宜入京师、利西北之行、夏占不利。
谒见：利见大人、有德行之人、宜见官贵、可见。
疾病：头面之疾、肺疾、筋骨疾、上焦疾、夏占不安。
官讼：健讼、有贵人助、秋占得胜、夏占失理。
坟墓：宜向西北、宜乾山气脉、宜天穴、宜高、秋占出贵、夏占大凶。
方道：西北。
五色：大赤色、玄色。
姓字：带金旁者、商音、行位一四九。
数目：一、四、九。
五味：辛、辣。`
    },
    {
        id: 'dui',
        name: '兑卦',
        description: `二 金
兑为金 泽水困 泽地萃 泽山咸
水山蹇 地山谦 雷山小过 雷泽归妹
天时：雨泽、新月、星。
地理：泽、水际、缺池、废井、山崩破裂之地、其地为刚卤。
人物：少女、妾、歌妓、伶人、译人、巫师。
静物：金刀、金类、乐器、废物、缺器。
身体：舌、口喉、肺、痰、涎。
动物：羊、泽中之物。
人事：喜悦、口、谗毁、谤说、饮食。
时序：秋八月、酉年月日时、二四九月日。
屋舍：西向之居、近泽之居、败墙壁宅、户有损。
家宅：不安、防口舌、秋占喜悦、夏占家宅有祸。
饮食：羊肉、泽中之物、宿味、辛辣之味。
婚姻：不成、秋占可成、有喜、主成婚之吉、利婚少女、夏占不利。
生产：不利、恐有损胎或则生女、夏占不利、宜坐向西。
求名：难成、因名有损、利西之任、宜刑官、武职、伶官、译官。
求利：无利、有损、财利、主口舌、秋占有财喜、夏占破财。
出行：不宜远行、防口舌、或损失、宜西行、秋占宜行有利。
交易：难利、防口舌、有争竞、夏占不利、秋占有交易之财。
谋旺：难成、谋中有损、秋占有喜、夏占不遂。
谒见：利行西方、见有咒诅。
疾病：口舌、咽喉之疾、气逆喘疾、饮食不飧。
坟墓：宜西向、防穴中有水、近泽之墓、夏占不宜、或葬废穴。
官讼：争讼不已、曲直未决、因讼有损、防刑、秋占为体得理胜讼。
姓字：商音、带口带金字旁姓氏、行位四二九。
数目：四、二、九。
方道：西方。
五色：白。
五味：辛、辣。`
    },
    {
        id: 'li',
        name: '离卦',
        description: `三 火
离为火 火山旅 火风鼎 火水末济
山水蒙 风水涣 天水讼 天火同人
天时：日、电、虹、霓、霞。
地理：南方、干亢之地、窖灶、炉冶之所、刚燥厥地、其地面陽。
人物：中女、文人、大腹、目疾人、甲胄之士。
静物：火、书、文、甲胄、干戈、槁衣、干燥之物、赤色之物。
身体：目、心、上焦。
动物：雉、龟、鳖、蟹、螺、蚌。
人事：文画之所、聪明才学、相见虚心、书事。
时序：夏五月、午火年月日时、三二七日。
屋舍：南舍之居、陽明之宅、明窗、虚室。
家宅：安稳、平善、冬占不安、克体主火灾。
饮食：雉肉、煎炒、烧炙之物、干脯之体、热肉。
婚姻：不成、利中女之婚、夏占可成、冬占不利。
生产：易生、产中女、冬占有损、坐宜向南。
求名：有名、宜南方之职、文官之任、宜炉冶亢场之职。
求利：有财宜南方求、有文书之财、冬占有失。
谋旺：可以谋旺、宜文书之事。
交易：可成、宜有文书之交易。
出行：可行、宜向南方、就文书之行、冬占不宜行、不宜行舟。
谒见：可见南方人、冬占不顺、秋见文书考案之士。
官讼：易散、文书动、辞讼明辨。
疾病：目疾、心疾、上焦热病、夏占伏暑、时疫。
坟墓：南向之幕、无树木之所、陽穴。夏占出文人、冬占不利。
姓字：徵音、立人旁士姓氏、行位三二七。
数目：三、二、七。
方道：南。
五色：赤、紫、红。
五味：苦。`
    },
    {
        id: 'zhen',
        name: '震卦',
        description: `四 木
震为雷 雷地豫 雷水解 雷风恒
地风升 水风井 泽风大过 泽雷随
天时：雷。
地理：东方、树木、闹市、大途、竹林、草木茂盛之所。
人物：长男。
静物：木竹、萑苇、乐器（属竹木者）、花草繁鲜之物。
身体：足、肝、发、声音。
动物：龙、蛇。
人事：起动、怒、虚惊、鼓动噪、多动少静。
时序：春三月、卯年月日时、四三八月日。
屋舍：东向之居、山林之处、楼阁。
家宅：宅中不时有虚惊、春冬吉、秋占不利。
饮食：蹄、肉、山林野味、鲜肉、果酸味、菜蔬。
婚姻：可、有成、声名之家、得长男之婚、秋占不宜婚。
求利：山林竹木之财、动处求财、或山林、竹木茶货之利。
求名：有名、宜东方之任、施号发令之职、掌刑狱之官、竹茶木税课之任、或闹市司货之职。
生产：虚惊、胎动不安、头胎必生男、坐宜东向、秋占必有损。
疾病：足疾、肝经之疾、惊怖不安。
谋旺：可旺、可求、宜动中谋、秋占不遂。
交易：利于成交、秋占难成、动而可成、山林、木竹茶货之利。
官讼：健讼、有虚惊、行移取甚反复。
谒见：可见、在山林之人、利见宜有声名之人。
出行：宜行、利于东方、利山林之人、秋占不宜行、但恐虚惊。
坟墓：利于东向、山林中穴、秋不利。
姓字：角音、带木姓人、行位四八三。
数目：四、八、三。
方道：东。
五味：甘、酸味。
五色：青、绿、碧`
    },
    {
        id: 'xun',
        name: '巽卦',
        description: `五 木
巽为风 风天小畜 风火家人 风雷益
天雷无妄 火雷噬嗑 山雷颐 山风蛊
天时：风。
地理：东南方之地、草木茂秀之所、花果菜园。
人物：长女、秀士、寡妇之人、山林仙道之人。
静物：木香、绳、直物、长物、竹木、工巧之器。
身体：肱、股、气、风疾。
动物：鸡、百禽、山林中之禽、虫。
人事：柔和、不定、鼓舞、利市三倍、进退不果。
时序：春夏之交、三五八之时月日、辰巳月日时。
屋舍：东南向之居、寺观楼台、山林之居。
家宅：安稳利市、春占吉、秋占不安。
饮食：鸡肉、山林之味、蔬果酸味。
婚姻：可成、宜长女之婚、秋占不利。
生产：易生、头胎产女、秋占损胎、宜向东南坐。
求名：有名、宜文职有风宪之力、宜为风宪、宜茶果竹木税货之职、宜东南之任。
求利：有利三倍、宜山林之利、秋占不利、竹货木货之利。
交易：可成、进退不一、利山林交易、山林木茶之利。
谋旺：可谋旺、有财可成、秋占多谋少遂。
出行：可行、有出入之利、宜向东南行、秋占不利。
谒见：可见、利见山林之人、利见文人秀士。
疾病：股肱之疾、风疾、肠疾、中风、寒邪、气疾。
姓字：角音、草木旁姓氏、行位五三八。
官讼：宜和、恐遭风宪之责。
坟墓：宜东南方向、山林之穴、多树木、秋占不利。
数目：五、三、八。
方道：东南。
五味：酸味。
五色：青、绿、碧、洁白。`
    },
    {
        id: 'kan',
        name: '坎卦',
        description: `六 水
坎为水 水泽节 水雷屯 水火既济
泽火革 雷火丰 地火明夷 地水师
天时：月、雨、雪、霜、露。
地理：北方、江湖、溪涧、泉井、卑湿之地（沟渎、池沼、凡有水处）。
人物：中男、江湖之人、舟人、资贼。
静物：水带子、带核之物、弓轮、矫揉之物、酒器、水具。
身体：耳、血、肾。
动物：猪、鱼、水中物、水鸟、鼠、四足动物
人事：险陷卑下、外示以柔、内序以利、漂泊不成、随波逐流。
时序：冬十一月、子年月日时、一六月日。
屋舍：向北之居、近水、水阁、江楼、花酒长器、宅中混地之处。
饮食：豕肉、酒、冷味、海味、汤、酸味、宿食、鱼、带血、掩藏、有带核之物、水中之物、多骨之物。
家宅：不安、暗昧、防盗。
婚姻：利中男之婚、宜北方之婚、辰戌丑未月婚不可。
生产：难产有险、宜次胎、中男、辰戌丑未月有损、宜北向。
求名：艰难、恐有灾险、宜北方之任、鱼盐河泊之职。
求利：有财失、宜水边财、恐有失陷、宜鱼盐酒货之利、防遗失、防盗。
交易：不利成交、恐防失陷、宜水边交易、宜鱼盐货之交易、或点水人之交易。
谋旺：不宜谋旺、不能成就、秋冬占可谋旺。
出行：不宜远行、宜涉舟、宜北方之行、防盗、恐遇险陷溺之事。
谒见：难见、宜见江湖之人、或有水旁姓氏之人。
疾病：耳痛、心疾、感寒、肾疾、胃冷、水泻、痼冷之病、血病。
官讼：不利、有陰险、有失、因讼、失陷。
坟墓：宜北向之穴、近水傍之墓、不利葬。
姓字：羽音、点水旁之姓氏、行位一六。
数目：一、六。
方道：北方。
五味：咸、酸。
五色：黑。`
    },
    {
        id: 'gen',
        name: '艮卦',
        description: `七 土
艮为山 山火贲 山天大畜 山泽损
火泽睽 天泽履 风泽中孚 风山渐
天时：云、雾、山岚。
地理：山径路、近山城、丘陵、坟墓、东北方。
人物：少男、闲人、山中人。
静物：土石、瓜果、黄物、土中之物。
身体：手指、骨、鼻、背。
动物：虎、狗、鼠、百兽、黔啄之物。
人事：阻隔、守静、进退不决、反背、止住、不见。
时序：冬春之月、十二月丑寅年月日时、七五十数月日、土年月日时。
家宅：安稳、诸事有阻、家人不睦、春占不安。
屋舍：东北方之居、山居近石、近路之宅。
饮食：土中物味、诸兽之肉、墓畔竹笋之属、野味。
婚姻：阻隔难成、成亦迟、利少男之婚、春占不利、宜对乡里婚。
求名：阻隔无名、宜东北方之任、宜土官山城之职。
求利：求财阻隔、宜山林中取财、春占不利、有损失。
生产：难生、有险阻之厄、宜向东北、春占有损。
交易：难成、有山林田土之交易、春占有失。
谋旺：阻隔难成、进退不决。
出行：不宜远行、有阻、宜近陆行。
谒见：不可见、有阻、宜见山林之人。
疾病：手指之疾、脾胃之疾。
官讼：贵人阻滞、官讼未解、牵连不决。
坟墓：东北之穴、山中之穴、春占不利、近路旁有石。
数目：五、七、十。
方道：东北方。
五色：黄。
五味：甘。`
    },
    {
        id: 'kun',
        name: '坤卦',
        description: `八 土
坤为地 地雷复 地泽临 地天泰
雷天大壮 泽天决 水天需 水地比
天时：云陰、雾气。
地理：田野、乡里、平地、西南方。
人物：老母、后母、农夫、乡人、众人、大腹人。
静物：方物、柔物、布帛、丝绵、五谷、舆釜、瓦器。
身体：腹、脾、胃、肉。
动物：牛、百兽、牝马。
人事：吝啬、柔顺、懦弱、众多。
时序：辰戌丑未月、未申年月日时、八五十月日。
屋舍：西南向、村居、田舍、矮屋、土阶、仓库。
家宅：安稳、多陰气、春占宅舍不安。
饮食：牛肉、土中之物、甘味、野味、五谷之味、芋笋之物、腹脏之物。
婚姻：利于婚姻、宜税产之家、乡村之家、或寡妇之家、春占不利。
生产：易产、春占难产、有损、或不利于母、坐宜西南方。
求名：有名、宜西南方或教官、农官守土之职、春占虚名。
交易：宜利交易、宜田土交易、宜五谷、利贱货、重物、布帛、静中有财、春占不利。
求利：有利、宜土中之利、贱货重物之利、静中得财、春占无财、多中取利。
谋旺：利求谋、乡里求谋、静中求谋、春占少遂、或谋于妇人。
出行：可行、宜西南行、宜往乡里行、宜陆行、春占不宜行。
谒见：可见、利见乡人、宜见亲朋或陰人、春不宜见。
疾病：腹疾、脾胃之疾、饮食停伤、谷食不化。
官讼：理顺、得众情、讼当解散。
坟墓：宜向西南之穴、平陽之地、近田野、宜低葬、春不可葬。
姓字：宫音、带土姓人、行位八五十。
数目：八、五、十。
方道：西南。
五味：甘。
五色：黄、黑。`
    }
];
